cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401Y.svd
<?xml version="1.0" encoding="utf-8"?>
<device schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd" >

   <vendor>Texas Instruments</vendor>
   <vendorID>ti.com</vendorID>
   <name>MSP432P401Y</name>
   <version>3.230</version>
   <description>ARM Cortex-M4 MSP432P4xx Device</description>
   <licenseText>
\n
    Copyright (C) 2012-2018 Texas Instruments Incorporated - http://www.ti.com/\n
\n
    Redistribution and use in source and binary forms, with or without\n
    modification, are permitted provided that the following conditions\n
    are met:
\n
    Redistributions of source code must retain the above copyright\n
    notice, this list of conditions and the following disclaimer.\n
\n
    Redistributions in binary form must reproduce the above copyright\n
    notice, this list of conditions and the following disclaimer in the\n
    documentation and/or other materials provided with the\n
    distribution.\n
\n
    Neither the name of Texas Instruments Incorporated nor the names of\n
    its contributors may be used to endorse or promote products derived\n
    from this software without specific prior written permission.\n
\n
    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n
    "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n
    LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\n
    A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\n
    OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\n
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\n
    LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n
    DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\n
    THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n
    (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\n
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n
\n
  </licenseText>
   <!-- Bus Interface Properties -->
   <addressUnitBits>8</addressUnitBits> 
   <width>32</width>
   <!-- -->
   <!-- Register Default Properties -->
   <size>32</size>
   <!-- -->
   <peripherals>
    <peripheral>
        <name>TLV</name>
        <version>356.0</version>
        <description>TLV</description>
        <baseAddress>0x201000</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x15C</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>TLV_CHECKSUM</name>
                  <displayName>TLV_CHECKSUM</displayName>
                  <description>TLV Checksum</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>DEVICE_INFO_TAG</name>
                  <displayName>DEVICE_INFO_TAG</displayName>
                  <description>Device Info Tag</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x0000000b</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>DEVICE_INFO_LEN</name>
                  <displayName>DEVICE_INFO_LEN</displayName>
                  <description>Device Info Length</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>DEVICE_ID</name>
                  <displayName>DEVICE_ID</displayName>
                  <description>Device ID</description>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>HWREV</name>
                  <displayName>HWREV</displayName>
                  <description>HW Revision</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>BCREV</name>
                  <displayName>BCREV</displayName>
                  <description>Boot Code Revision</description>
                  <addressOffset>0x14</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>ROM_DRVLIB_REV</name>
                  <displayName>ROM_DRVLIB_REV</displayName>
                  <description>ROM Driver Library Revision</description>
                  <addressOffset>0x18</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>DIE_REC_TAG</name>
                  <displayName>DIE_REC_TAG</displayName>
                  <description>Die Record Tag</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x0000000c</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>DIE_REC_LEN</name>
                  <displayName>DIE_REC_LEN</displayName>
                  <description>Die Record Length</description>
                  <addressOffset>0x20</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>DIE_XPOS</name>
                  <displayName>DIE_XPOS</displayName>
                  <description>Die X-Position</description>
                  <addressOffset>0x24</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>DIE_YPOS</name>
                  <displayName>DIE_YPOS</displayName>
                  <description>Die Y-Position</description>
                  <addressOffset>0x28</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>WAFER_ID</name>
                  <displayName>WAFER_ID</displayName>
                  <description>Wafer ID</description>
                  <addressOffset>0x2C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>LOT_ID</name>
                  <displayName>LOT_ID</displayName>
                  <description>Lot ID</description>
                  <addressOffset>0x30</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED0</name>
                  <displayName>RESERVED0</displayName>
                  <description>Reserved</description>
                  <addressOffset>0x34</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED1</name>
                  <displayName>RESERVED1</displayName>
                  <description>Reserved</description>
                  <addressOffset>0x38</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED2</name>
                  <displayName>RESERVED2</displayName>
                  <description>Reserved</description>
                  <addressOffset>0x3C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>TEST_RESULTS</name>
                  <displayName>TEST_RESULTS</displayName>
                  <description>Test Results</description>
                  <addressOffset>0x40</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>CS_CAL_TAG</name>
                  <displayName>CS_CAL_TAG</displayName>
                  <description>Clock System Calibration Tag</description>
                  <addressOffset>0x44</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000003</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>CS_CAL_LEN</name>
                  <displayName>CS_CAL_LEN</displayName>
                  <description>Clock System Calibration Length</description>
                  <addressOffset>0x48</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>DCOIR_FCAL_RSEL04</name>
                  <displayName>DCOIR_FCAL_RSEL04</displayName>
                  <description>DCO IR mode: Frequency calibration for DCORSEL 0 to 4</description>
                  <addressOffset>0x4C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>DCOIR_FCAL_RSEL5</name>
                  <displayName>DCOIR_FCAL_RSEL5</displayName>
                  <description>DCO IR mode: Frequency calibration for DCORSEL 5</description>
                  <addressOffset>0x50</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED3</name>
                  <displayName>RESERVED3</displayName>
                  <description>Reserved</description>
                  <addressOffset>0x54</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED4</name>
                  <displayName>RESERVED4</displayName>
                  <description>Reserved</description>
                  <addressOffset>0x58</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED5</name>
                  <displayName>RESERVED5</displayName>
                  <description>Reserved</description>
                  <addressOffset>0x5C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED6</name>
                  <displayName>RESERVED6</displayName>
                  <description>Reserved</description>
                  <addressOffset>0x60</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>DCOIR_CONSTK_RSEL04</name>
                  <displayName>DCOIR_CONSTK_RSEL04</displayName>
                  <description>DCO IR mode: DCO Constant (K) for DCORSEL 0 to 4</description>
                  <addressOffset>0x64</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>DCOIR_CONSTK_RSEL5</name>
                  <displayName>DCOIR_CONSTK_RSEL5</displayName>
                  <description>DCO IR mode: DCO Constant (K) for DCORSEL 5</description>
                  <addressOffset>0x68</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>DCOER_FCAL_RSEL04</name>
                  <displayName>DCOER_FCAL_RSEL04</displayName>
                  <description>DCO ER mode: Frequency calibration for DCORSEL 0 to 4</description>
                  <addressOffset>0x6C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>DCOER_FCAL_RSEL5</name>
                  <displayName>DCOER_FCAL_RSEL5</displayName>
                  <description>DCO ER mode: Frequency calibration for DCORSEL 5</description>
                  <addressOffset>0x70</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED7</name>
                  <displayName>RESERVED7</displayName>
                  <description>Reserved</description>
                  <addressOffset>0x74</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED8</name>
                  <displayName>RESERVED8</displayName>
                  <description>Reserved</description>
                  <addressOffset>0x78</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED9</name>
                  <displayName>RESERVED9</displayName>
                  <description>Reserved</description>
                  <addressOffset>0x7C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED10</name>
                  <displayName>RESERVED10</displayName>
                  <description>Reserved</description>
                  <addressOffset>0x80</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>DCOER_CONSTK_RSEL04</name>
                  <displayName>DCOER_CONSTK_RSEL04</displayName>
                  <description>DCO ER mode: DCO Constant (K) for DCORSEL 0 to 4</description>
                  <addressOffset>0x84</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>DCOER_CONSTK_RSEL5</name>
                  <displayName>DCOER_CONSTK_RSEL5</displayName>
                  <description>DCO ER mode: DCO Constant (K) for DCORSEL 5</description>
                  <addressOffset>0x88</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>ADC14_CAL_TAG</name>
                  <displayName>ADC14_CAL_TAG</displayName>
                  <description>ADC14 Calibration Tag</description>
                  <addressOffset>0x8C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000005</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>ADC14_CAL_LEN</name>
                  <displayName>ADC14_CAL_LEN</displayName>
                  <description>ADC14 Calibration Length</description>
                  <addressOffset>0x90</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>ADC_GAIN_FACTOR</name>
                  <displayName>ADC_GAIN_FACTOR</displayName>
                  <description>ADC Gain Factor</description>
                  <addressOffset>0x94</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>ADC_OFFSET</name>
                  <displayName>ADC_OFFSET</displayName>
                  <description>ADC Offset</description>
                  <addressOffset>0x98</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED11</name>
                  <displayName>RESERVED11</displayName>
                  <description>Reserved</description>
                  <addressOffset>0x9C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED12</name>
                  <displayName>RESERVED12</displayName>
                  <description>Reserved</description>
                  <addressOffset>0xA0</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED13</name>
                  <displayName>RESERVED13</displayName>
                  <description>Reserved</description>
                  <addressOffset>0xA4</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED14</name>
                  <displayName>RESERVED14</displayName>
                  <description>Reserved</description>
                  <addressOffset>0xA8</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED15</name>
                  <displayName>RESERVED15</displayName>
                  <description>Reserved</description>
                  <addressOffset>0xAC</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED16</name>
                  <displayName>RESERVED16</displayName>
                  <description>Reserved</description>
                  <addressOffset>0xB0</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED17</name>
                  <displayName>RESERVED17</displayName>
                  <description>Reserved</description>
                  <addressOffset>0xB4</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
