cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401Y.svd
            <register>
                  <name>RESERVED18</name>
                  <displayName>RESERVED18</displayName>
                  <description>Reserved</description>
                  <addressOffset>0xB8</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED19</name>
                  <displayName>RESERVED19</displayName>
                  <description>Reserved</description>
                  <addressOffset>0xBC</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED20</name>
                  <displayName>RESERVED20</displayName>
                  <description>Reserved</description>
                  <addressOffset>0xC0</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED21</name>
                  <displayName>RESERVED21</displayName>
                  <description>Reserved</description>
                  <addressOffset>0xC4</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED22</name>
                  <displayName>RESERVED22</displayName>
                  <description>Reserved</description>
                  <addressOffset>0xC8</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED23</name>
                  <displayName>RESERVED23</displayName>
                  <description>Reserved</description>
                  <addressOffset>0xCC</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED24</name>
                  <displayName>RESERVED24</displayName>
                  <description>Reserved</description>
                  <addressOffset>0xD0</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED25</name>
                  <displayName>RESERVED25</displayName>
                  <description>Reserved</description>
                  <addressOffset>0xD4</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RESERVED26</name>
                  <displayName>RESERVED26</displayName>
                  <description>Reserved</description>
                  <addressOffset>0xD8</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>ADC14_REF1P2V_TS30C</name>
                  <displayName>ADC14_REF1P2V_TS30C</displayName>
                  <description>ADC14 1.2V Reference Temp. Sensor 30C</description>
                  <addressOffset>0xDC</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>ADC14_REF1P2V_TS85C</name>
                  <displayName>ADC14_REF1P2V_TS85C</displayName>
                  <description>ADC14 1.2V Reference Temp. Sensor 85C</description>
                  <addressOffset>0xE0</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>ADC14_REF1P45V_TS30C</name>
                  <displayName>ADC14_REF1P45V_TS30C</displayName>
                  <description>ADC14 1.45V Reference Temp. Sensor 30C</description>
                  <addressOffset>0xE4</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>ADC14_REF1P45V_TS85C</name>
                  <displayName>ADC14_REF1P45V_TS85C</displayName>
                  <description>ADC14 1.45V Reference Temp. Sensor 85C</description>
                  <addressOffset>0xE8</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>ADC14_REF2P5V_TS30C</name>
                  <displayName>ADC14_REF2P5V_TS30C</displayName>
                  <description>ADC14 2.5V Reference Temp. Sensor 30C</description>
                  <addressOffset>0xEC</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>ADC14_REF2P5V_TS85C</name>
                  <displayName>ADC14_REF2P5V_TS85C</displayName>
                  <description>ADC14 2.5V Reference Temp. Sensor 85C</description>
                  <addressOffset>0xF0</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>REF_CAL_TAG</name>
                  <displayName>REF_CAL_TAG</displayName>
                  <description>REF Calibration Tag</description>
                  <addressOffset>0xF4</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000008</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>REF_CAL_LEN</name>
                  <displayName>REF_CAL_LEN</displayName>
                  <description>REF Calibration Length</description>
                  <addressOffset>0xF8</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>REF_1P2V</name>
                  <displayName>REF_1P2V</displayName>
                  <description>REF 1.2V Reference</description>
                  <addressOffset>0xFC</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>REF_1P45V</name>
                  <displayName>REF_1P45V</displayName>
                  <description>REF 1.45V Reference</description>
                  <addressOffset>0x100</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>REF_2P5V</name>
                  <displayName>REF_2P5V</displayName>
                  <description>REF 2.5V Reference</description>
                  <addressOffset>0x104</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>FLASH_INFO_TAG</name>
                  <displayName>FLASH_INFO_TAG</displayName>
                  <description>Flash Info Tag</description>
                  <addressOffset>0x108</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000004</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>FLASH_INFO_LEN</name>
                  <displayName>FLASH_INFO_LEN</displayName>
                  <description>Flash Info Length</description>
                  <addressOffset>0x10C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>FLASH_MAX_PROG_PULSES</name>
                  <displayName>FLASH_MAX_PROG_PULSES</displayName>
                  <description>Flash Maximum Programming Pulses</description>
                  <addressOffset>0x110</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>FLASH_MAX_ERASE_PULSES</name>
                  <displayName>FLASH_MAX_ERASE_PULSES</displayName>
                  <description>Flash Maximum Erase Pulses</description>
                  <addressOffset>0x114</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RANDOM_NUM_TAG</name>
                  <displayName>RANDOM_NUM_TAG</displayName>
                  <description>128-bit Random Number Tag</description>
                  <addressOffset>0x118</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x0000000d</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RANDOM_NUM_LEN</name>
                  <displayName>RANDOM_NUM_LEN</displayName>
                  <description>128-bit Random Number Length</description>
                  <addressOffset>0x11C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RANDOM_NUM_1</name>
                  <displayName>RANDOM_NUM_1</displayName>
                  <description>32-bit Random Number 1</description>
                  <addressOffset>0x120</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RANDOM_NUM_2</name>
                  <displayName>RANDOM_NUM_2</displayName>
                  <description>32-bit Random Number 2</description>
                  <addressOffset>0x124</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RANDOM_NUM_3</name>
                  <displayName>RANDOM_NUM_3</displayName>
                  <description>32-bit Random Number 3</description>
                  <addressOffset>0x128</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>RANDOM_NUM_4</name>
                  <displayName>RANDOM_NUM_4</displayName>
                  <description>32-bit Random Number 4</description>
                  <addressOffset>0x12C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>BSL_CFG_TAG</name>
                  <displayName>BSL_CFG_TAG</displayName>
                  <description>BSL Configuration Tag</description>
                  <addressOffset>0x130</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x0000000f</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>BSL_CFG_LEN</name>
                  <displayName>BSL_CFG_LEN</displayName>
                  <description>BSL Configuration Length</description>
                  <addressOffset>0x134</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>BSL_PERIPHIF_SEL</name>
                  <displayName>BSL_PERIPHIF_SEL</displayName>
                  <description>BSL Peripheral Interface Selection</description>
                  <addressOffset>0x138</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>BSL_PORTIF_CFG_UART</name>
                  <displayName>BSL_PORTIF_CFG_UART</displayName>
                  <description>BSL Port Interface Configuration for UART</description>
                  <addressOffset>0x13C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>BSL_PORTIF_CFG_SPI</name>
                  <displayName>BSL_PORTIF_CFG_SPI</displayName>
                  <description>BSL Port Interface Configuration for SPI</description>
                  <addressOffset>0x140</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>BSL_PORTIF_CFG_I2C</name>
                  <displayName>BSL_PORTIF_CFG_I2C</displayName>
                  <description>BSL Port Interface Configuration for I2C</description>
                  <addressOffset>0x144</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
            <register>
                  <name>TLV_END</name>
                  <displayName>TLV_END</displayName>
                  <description>TLV End Word</description>
                  <addressOffset>0x148</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x0bd0e11d</resetValue>
                  <resetMask>0xffffffff</resetMask>
            </register>
