cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401Y.svd
            <register>
                  <name>UCBxBRW</name>
                  <displayName>BRW</displayName>
                  <description>eUSCI_Bx Baud Rate Control Word Register</description>
                  <addressOffset>0x6</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>UCBR</name>
                        <description>Bit clock prescaler</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>UCBxSTATW</name>
                  <displayName>STATW</displayName>
                  <description>eUSCI_Bx Status Register</description>
                  <addressOffset>0x8</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>UCBBUSY</name>
                        <description>Bus busy</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>UCBBUSY_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>UCBBUSY_0</name>
                                <description>Bus inactive</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCBBUSY_1</name>
                                <description>Bus busy</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCGC</name>
                        <description>General call address received</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>UCGC_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>UCGC_0</name>
                                <description>No general call address received</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCGC_1</name>
                                <description>General call address received</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCSCLLOW</name>
                        <description>SCL low</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>UCSCLLOW_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>UCSCLLOW_0</name>
                                <description>SCL is not held low</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCSCLLOW_1</name>
                                <description>SCL is held low</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCBCNT</name>
                        <description>Hardware byte counter value</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>UCBxTBCNT</name>
                  <displayName>TBCNT</displayName>
                  <description>eUSCI_Bx Byte Counter Threshold Register</description>
                  <addressOffset>0xA</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>UCTBCNT</name>
                        <description>Byte counter threshold value</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>UCBxRXBUF</name>
                  <displayName>RXBUF</displayName>
                  <description>eUSCI_Bx Receive Buffer Register</description>
                  <addressOffset>0xC</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>UCRXBUF</name>
                        <description>Receive data buffer</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>UCBxTXBUF</name>
                  <displayName>TXBUF</displayName>
                  <description>eUSCI_Bx Transmit Buffer Register</description>
                  <addressOffset>0xE</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>UCTXBUF</name>
                        <description>Transmit data buffer</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>UCBxI2COA0</name>
                  <displayName>I2COA0</displayName>
                  <description>eUSCI_Bx I2C Own Address 0 Register</description>
                  <addressOffset>0x14</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>I2COA0</name>
                        <description>I2C own address</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0xA</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>UCOAEN</name>
                        <description>Own Address enable register</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCOAEN_0</name>
                                <description>The slave address defined in I2COA0 is disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCOAEN_1</name>
                                <description>The slave address defined in I2COA0 is enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCGCEN</name>
                        <description>General call response enable</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCGCEN_0</name>
                                <description>Do not respond to a general call</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCGCEN_1</name>
                                <description>Respond to a general call</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>UCBxI2COA1</name>
                  <displayName>I2COA1</displayName>
                  <description>eUSCI_Bx I2C Own Address 1 Register</description>
                  <addressOffset>0x16</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>I2COA1</name>
                        <description>I2C own address</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0xA</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>UCOAEN</name>
                        <description>Own Address enable register</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCOAEN_0</name>
                                <description>The slave address defined in I2COA1 is disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCOAEN_1</name>
                                <description>The slave address defined in I2COA1 is enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>UCBxI2COA2</name>
                  <displayName>I2COA2</displayName>
                  <description>eUSCI_Bx I2C Own Address 2 Register</description>
                  <addressOffset>0x18</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>I2COA2</name>
                        <description>I2C own address</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0xA</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>UCOAEN</name>
                        <description>Own Address enable register</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCOAEN_0</name>
                                <description>The slave address defined in I2COA2 is disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCOAEN_1</name>
                                <description>The slave address defined in I2COA2 is enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>UCBxI2COA3</name>
                  <displayName>I2COA3</displayName>
                  <description>eUSCI_Bx I2C Own Address 3 Register</description>
                  <addressOffset>0x1A</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>I2COA3</name>
                        <description>I2C own address</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0xA</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>UCOAEN</name>
                        <description>Own Address enable register</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCOAEN_0</name>
                                <description>The slave address defined in I2COA3 is disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCOAEN_1</name>
                                <description>The slave address defined in I2COA3 is enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>UCBxADDRX</name>
                  <displayName>ADDRX</displayName>
                  <description>eUSCI_Bx I2C Received Address Register</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>ADDRX</name>
                        <description>Received Address Register</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0xA</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>UCBxADDMASK</name>
                  <displayName>ADDMASK</displayName>
                  <description>eUSCI_Bx I2C Address Mask Register</description>
                  <addressOffset>0x1E</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x000003ff</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>ADDMASK</name>
                        <description>Address Mask Register. By clearing the corresponding bit of the own address, this bit is a don't care when comparing the address on the bus to the own address. Using this method, it is possible to react on more than one slave address. When all bits of ADDMASKx are set, the address mask feature is deactivated.
Modify only when UCSWRST = 1.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0xA</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>UCBxI2CSA</name>
                  <displayName>I2CSA</displayName>
                  <description>eUSCI_Bx I2C Slave Address Register</description>
                  <addressOffset>0x20</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>I2CSA</name>
                        <description>I2C slave address</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0xA</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
