cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401Y.svd
            <register>
                  <name>PBOUT</name>
                  <displayName>PBOUT</displayName>
                  <description>Port B Output</description>
                  <addressOffset>0x22</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>P3OUT</name>
                        <description>Port 3 Output</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P4OUT</name>
                        <description>Port 4 Output</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PBDIR</name>
                  <displayName>PBDIR</displayName>
                  <description>Port B Direction</description>
                  <addressOffset>0x24</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P3DIR</name>
                        <description>Port 3 Direction</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P4DIR</name>
                        <description>Port 4 Direction</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PBREN</name>
                  <displayName>PBREN</displayName>
                  <description>Port B Resistor Enable</description>
                  <addressOffset>0x26</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P3REN</name>
                        <description>Port 3 Resistor Enable</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P4REN</name>
                        <description>Port 4 Resistor Enable</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PBDS</name>
                  <displayName>PBDS</displayName>
                  <description>Port B Drive Strength</description>
                  <addressOffset>0x28</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>P3DS</name>
                        <description>Port 3 Drive Strength</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P4DS</name>
                        <description>Port 4 Drive Strength</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PBSEL0</name>
                  <displayName>PBSEL0</displayName>
                  <description>Port B Select 0</description>
                  <addressOffset>0x2A</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P4SEL0</name>
                        <description>Port 4 Select 0</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P3SEL0</name>
                        <description>Port 3 Select 0</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PBSEL1</name>
                  <displayName>PBSEL1</displayName>
                  <description>Port B Select 1</description>
                  <addressOffset>0x2C</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P3SEL1</name>
                        <description>Port 3 Select 1</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P4SEL1</name>
                        <description>Port 4 Select 1</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P3IV</name>
                  <displayName>P3IV</displayName>
                  <description>Port 3 Interrupt Vector Register</description>
                  <addressOffset>0x2E</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P3IV</name>
                        <description>Port 3 interrupt vector value</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>P3IV_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>P3IV_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P3IV_2</name>
                                <description>Interrupt Source: Port 3.0 interrupt; Interrupt Flag: P3IFG0; Interrupt Priority: Highest</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P3IV_4</name>
                                <description>Interrupt Source: Port 3.1 interrupt; Interrupt Flag: P3IFG1</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P3IV_6</name>
                                <description>Interrupt Source: Port 3.2 interrupt; Interrupt Flag: P3IFG2</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P3IV_8</name>
                                <description>Interrupt Source: Port 3.3 interrupt; Interrupt Flag: P3IFG3</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P3IV_10</name>
                                <description>Interrupt Source: Port 3.4 interrupt; Interrupt Flag: P3IFG4</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P3IV_12</name>
                                <description>Interrupt Source: Port 3.5 interrupt; Interrupt Flag: P3IFG5</description>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P3IV_14</name>
                                <description>Interrupt Source: Port 3.6 interrupt; Interrupt Flag: P3IFG6</description>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P3IV_16</name>
                                <description>Interrupt Source: Port 3.7 interrupt; Interrupt Flag: P3IFG7; Interrupt Priority: Lowest</description>
                                <value>16</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PBSELC</name>
                  <displayName>PBSELC</displayName>
                  <description>Port B Complement Select</description>
                  <addressOffset>0x36</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P3SELC</name>
                        <description>Port 3 Complement Select</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P4SELC</name>
                        <description>Port 4 Complement Select</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PBIES</name>
                  <displayName>PBIES</displayName>
                  <description>Port B Interrupt Edge Select</description>
                  <addressOffset>0x38</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>P3IES</name>
                        <description>Port 3 Interrupt Edge Select</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P4IES</name>
                        <description>Port 4 Interrupt Edge Select</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PBIE</name>
                  <displayName>PBIE</displayName>
                  <description>Port B Interrupt Enable</description>
                  <addressOffset>0x3A</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P3IE</name>
                        <description>Port 3 Interrupt Enable</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P4IE</name>
                        <description>Port 4 Interrupt Enable</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PBIFG</name>
                  <displayName>PBIFG</displayName>
                  <description>Port B Interrupt Flag</description>
                  <addressOffset>0x3C</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P3IFG</name>
                        <description>Port 3 Interrupt Flag</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P4IFG</name>
                        <description>Port 4 Interrupt Flag</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P4IV</name>
                  <displayName>P4IV</displayName>
                  <description>Port 4 Interrupt Vector Register</description>
                  <addressOffset>0x3E</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <fields>
                    <field>
                        <name>P4IV</name>
                        <description>Port 4 interrupt vector value</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>P4IV_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>P4IV_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P4IV_2</name>
                                <description>Interrupt Source: Port 4.0 interrupt; Interrupt Flag: P4IFG0; Interrupt Priority: Highest</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P4IV_4</name>
                                <description>Interrupt Source: Port 4.1 interrupt; Interrupt Flag: P4IFG1</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P4IV_6</name>
                                <description>Interrupt Source: Port 4.2 interrupt; Interrupt Flag: P4IFG2</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P4IV_8</name>
                                <description>Interrupt Source: Port 4.3 interrupt; Interrupt Flag: P4IFG3</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P4IV_10</name>
                                <description>Interrupt Source: Port 4.4 interrupt; Interrupt Flag: P4IFG4</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P4IV_12</name>
                                <description>Interrupt Source: Port 4.5 interrupt; Interrupt Flag: P4IFG5</description>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P4IV_14</name>
                                <description>Interrupt Source: Port 4.6 interrupt; Interrupt Flag: P4IFG6</description>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P4IV_16</name>
                                <description>Interrupt Source: Port 4.7 interrupt; Interrupt Flag: P4IFG7; Interrupt Priority: Lowest</description>
                                <value>16</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PCIN</name>
                  <displayName>PCIN</displayName>
                  <description>Port C Input</description>
                  <addressOffset>0x40</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>P5IN</name>
                        <description>Port 5 Input</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>P6IN</name>
                        <description>Port 6 Input</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PCOUT</name>
                  <displayName>PCOUT</displayName>
                  <description>Port C Output</description>
                  <addressOffset>0x42</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>P5OUT</name>
                        <description>Port 5 Output</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P6OUT</name>
                        <description>Port 6 Output</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PCDIR</name>
                  <displayName>PCDIR</displayName>
                  <description>Port C Direction</description>
                  <addressOffset>0x44</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P5DIR</name>
                        <description>Port 5 Direction</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P6DIR</name>
                        <description>Port 6 Direction</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PCREN</name>
                  <displayName>PCREN</displayName>
                  <description>Port C Resistor Enable</description>
                  <addressOffset>0x46</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P5REN</name>
                        <description>Port 5 Resistor Enable</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P6REN</name>
                        <description>Port 6 Resistor Enable</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
