cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401Y.svd
            <register>
                  <name>DMA_INT0_SRCFLG</name>
                  <displayName>INT0_SRCFLG</displayName>
                  <description>Interrupt 0 Source Channel Flag Register</description>
                  <addressOffset>0x110</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>CH0</name>
                        <description>Channel 0 was the source of DMA_INT0</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH1</name>
                        <description>Channel 1 was the source of DMA_INT0</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH2</name>
                        <description>Channel 2 was the source of DMA_INT0</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH3</name>
                        <description>Channel 3 was the source of DMA_INT0</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH4</name>
                        <description>Channel 4 was the source of DMA_INT0</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH5</name>
                        <description>Channel 5 was the source of DMA_INT0</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH6</name>
                        <description>Channel 6 was the source of DMA_INT0</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH7</name>
                        <description>Channel 7 was the source of DMA_INT0</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH8</name>
                        <description>Channel 8 was the source of DMA_INT0</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH9</name>
                        <description>Channel 9 was the source of DMA_INT0</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH10</name>
                        <description>Channel 10 was the source of DMA_INT0</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH11</name>
                        <description>Channel 11 was the source of DMA_INT0</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH12</name>
                        <description>Channel 12 was the source of DMA_INT0</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH13</name>
                        <description>Channel 13 was the source of DMA_INT0</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH14</name>
                        <description>Channel 14 was the source of DMA_INT0</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH15</name>
                        <description>Channel 15 was the source of DMA_INT0</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH16</name>
                        <description>Channel 16 was the source of DMA_INT0</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH17</name>
                        <description>Channel 17 was the source of DMA_INT0</description>
                        <bitOffset>0x11</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH18</name>
                        <description>Channel 18 was the source of DMA_INT0</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH19</name>
                        <description>Channel 19 was the source of DMA_INT0</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH20</name>
                        <description>Channel 20 was the source of DMA_INT0</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH21</name>
                        <description>Channel 21 was the source of DMA_INT0</description>
                        <bitOffset>0x15</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH22</name>
                        <description>Channel 22 was the source of DMA_INT0</description>
                        <bitOffset>0x16</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH23</name>
                        <description>Channel 23 was the source of DMA_INT0</description>
                        <bitOffset>0x17</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH24</name>
                        <description>Channel 24 was the source of DMA_INT0</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH25</name>
                        <description>Channel 25 was the source of DMA_INT0</description>
                        <bitOffset>0x19</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH26</name>
                        <description>Channel 26 was the source of DMA_INT0</description>
                        <bitOffset>0x1A</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH27</name>
                        <description>Channel 27 was the source of DMA_INT0</description>
                        <bitOffset>0x1B</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH28</name>
                        <description>Channel 28 was the source of DMA_INT0</description>
                        <bitOffset>0x1C</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH29</name>
                        <description>Channel 29 was the source of DMA_INT0</description>
                        <bitOffset>0x1D</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH30</name>
                        <description>Channel 30 was the source of DMA_INT0</description>
                        <bitOffset>0x1E</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH31</name>
                        <description>Channel 31 was the source of DMA_INT0</description>
                        <bitOffset>0x1F</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DMA_INT0_CLRFLG</name>
                  <displayName>INT0_CLRFLG</displayName>
                  <description>Interrupt 0 Source Channel Clear Flag Register</description>
                  <addressOffset>0x114</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>CH0</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH1</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH2</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH3</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH4</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH5</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH6</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH7</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH8</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH9</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH10</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH11</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH12</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH13</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH14</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH15</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH16</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH17</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x11</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH18</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH19</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH20</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH21</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x15</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH22</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x16</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH23</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x17</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH24</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH25</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x19</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH26</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x1A</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH27</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x1B</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH28</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x1C</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH29</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x1D</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH30</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x1E</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CH31</name>
                        <description>Clear corresponding DMA_INT0_SRCFLG_REG</description>
                        <bitOffset>0x1F</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
