cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401Y.svd
            <register>
                  <name>CSSTAT</name>
                  <displayName>STAT</displayName>
                  <description>Status Register</description>
                  <addressOffset>0x34</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000003</resetValue>
                  <resetMask>0xffff01ff</resetMask>
                  <fields>
                    <field>
                        <name>DCO_ON</name>
                        <description>DCO status</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>DCO_ON_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>DCO_ON_0</name>
                                <description>Inactive</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DCO_ON_1</name>
                                <description>Active</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DCOBIAS_ON</name>
                        <description>DCO bias status</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>DCOBIAS_ON_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>DCOBIAS_ON_0</name>
                                <description>Inactive</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DCOBIAS_ON_1</name>
                                <description>Active</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HFXT_ON</name>
                        <description>HFXT status</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>HFXT_ON_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>HFXT_ON_0</name>
                                <description>Inactive</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HFXT_ON_1</name>
                                <description>Active</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HFXT2_ON</name>
                        <description>HFXT2 status</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>HFXT2_ON_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>HFXT2_ON_0</name>
                                <description>Inactive</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HFXT2_ON_1</name>
                                <description>Active</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>MODOSC_ON</name>
                        <description>MODOSC status</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>MODOSC_ON_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>MODOSC_ON_0</name>
                                <description>Inactive</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>MODOSC_ON_1</name>
                                <description>Active</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>VLO_ON</name>
                        <description>VLO status</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>VLO_ON_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>VLO_ON_0</name>
                                <description>Inactive</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>VLO_ON_1</name>
                                <description>Active</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LFXT_ON</name>
                        <description>LFXT status</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>LFXT_ON_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>LFXT_ON_0</name>
                                <description>Inactive</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LFXT_ON_1</name>
                                <description>Active</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>REFO_ON</name>
                        <description>REFO status</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>REFO_ON_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>REFO_ON_0</name>
                                <description>Inactive</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>REFO_ON_1</name>
                                <description>Active</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ACLK_ON</name>
                        <description>ACLK system clock status</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ACLK_ON_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ACLK_ON_0</name>
                                <description>Inactive</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACLK_ON_1</name>
                                <description>Active</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>MCLK_ON</name>
                        <description>MCLK system clock status</description>
                        <bitOffset>0x11</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>MCLK_ON_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>MCLK_ON_0</name>
                                <description>Inactive</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>MCLK_ON_1</name>
                                <description>Active</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HSMCLK_ON</name>
                        <description>HSMCLK system clock status</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>HSMCLK_ON_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>HSMCLK_ON_0</name>
                                <description>Inactive</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HSMCLK_ON_1</name>
                                <description>Active</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SMCLK_ON</name>
                        <description>SMCLK system clock status</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>SMCLK_ON_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>SMCLK_ON_0</name>
                                <description>Inactive</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SMCLK_ON_1</name>
                                <description>Active</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>MODCLK_ON</name>
                        <description>MODCLK system clock status</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>MODCLK_ON_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>MODCLK_ON_0</name>
                                <description>Inactive</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>MODCLK_ON_1</name>
                                <description>Active</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>VLOCLK_ON</name>
                        <description>VLOCLK system clock status</description>
                        <bitOffset>0x15</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>VLOCLK_ON_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>VLOCLK_ON_0</name>
                                <description>Inactive</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>VLOCLK_ON_1</name>
                                <description>Active</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LFXTCLK_ON</name>
                        <description>LFXTCLK system clock status</description>
                        <bitOffset>0x16</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>LFXTCLK_ON_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>LFXTCLK_ON_0</name>
                                <description>Inactive</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LFXTCLK_ON_1</name>
                                <description>Active</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>REFOCLK_ON</name>
                        <description>REFOCLK system clock status</description>
                        <bitOffset>0x17</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>REFOCLK_ON_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>REFOCLK_ON_0</name>
                                <description>Inactive</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>REFOCLK_ON_1</name>
                                <description>Active</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ACLK_READY</name>
                        <description>ACLK Ready status</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ACLK_READY_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ACLK_READY_0</name>
                                <description>Not ready</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACLK_READY_1</name>
                                <description>Ready</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>MCLK_READY</name>
                        <description>MCLK Ready status</description>
                        <bitOffset>0x19</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>MCLK_READY_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>MCLK_READY_0</name>
                                <description>Not ready</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>MCLK_READY_1</name>
                                <description>Ready</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HSMCLK_READY</name>
                        <description>HSMCLK Ready status</description>
                        <bitOffset>0x1A</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>HSMCLK_READY_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>HSMCLK_READY_0</name>
                                <description>Not ready</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HSMCLK_READY_1</name>
                                <description>Ready</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SMCLK_READY</name>
                        <description>SMCLK Ready status</description>
                        <bitOffset>0x1B</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>SMCLK_READY_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>SMCLK_READY_0</name>
                                <description>Not ready</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SMCLK_READY_1</name>
                                <description>Ready</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BCLK_READY</name>
                        <description>BCLK Ready status</description>
                        <bitOffset>0x1C</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>BCLK_READY_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>BCLK_READY_0</name>
                                <description>Not ready</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BCLK_READY_1</name>
                                <description>Ready</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
