cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401Y.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>PSS</name>
        <version>356.0</version>
        <description>PSS</description>
        <baseAddress>0x40010800</baseAddress>
        <interrupt>
            <name>PSS_IRQ</name>
            <description>PSS Interrupt</description>
            <value>0</value>
        </interrupt>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x40</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>PSSKEY</name>
                  <displayName>KEY</displayName>
                  <description>Key Register</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x0000a596</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>PSSKEY</name>
                        <description>PSS control key</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PSSCTL0</name>
                  <displayName>CTL0</displayName>
                  <description>Control 0 Register</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00002000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>SVSMHOFF</name>
                        <description>SVSM high-side off</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>SVSMHOFF_0</name>
                                <description>The SVSMH is on</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SVSMHOFF_1</name>
                                <description>The SVSMH is off</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SVSMHLP</name>
                        <description>SVSM high-side low power normal performance mode</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>SVSMHLP_0</name>
                                <description>Full performance mode. See the device-specific data sheet for response times.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SVSMHLP_1</name>
                                <description>Low power normal performance mode in LPM3, LPM4, and LPMx.5, full performance in all other modes. See the device-specific data sheet for response times.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SVSMHS</name>
                        <description>Supply supervisor or monitor selection for the high-side</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>SVSMHS_0</name>
                                <description>Configure as SVSH</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SVSMHS_1</name>
                                <description>Configure as SVMH</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SVSMHTH</name>
                        <description>SVSM high-side reset voltage level</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SVMHOE</name>
                        <description>SVSM high-side output enable</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>SVMHOE_0</name>
                                <description>SVSMHIFG bit is not output</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SVMHOE_1</name>
                                <description>SVSMHIFG bit is output to the device SVMHOUT pin. The device-specific port logic must be configured accordingly</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SVMHOUTPOLAL</name>
                        <description>SVMHOUT pin polarity active low</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>SVMHOUTPOLAL_0</name>
                                <description>SVMHOUT is active high. An error condition is signaled by a 1 at the SVMHOUT pin</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SVMHOUTPOLAL_1</name>
                                <description>SVMHOUT is active low. An error condition is signaled by a 0 at the SVMHOUT pin</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DCDC_FORCE</name>
                        <description>Force DC-DC regulator operation</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>DCDC_FORCE_0</name>
                                <description>DC-DC regulator operation not forced. Automatic fail-safe mechanism switches the core voltage regulator from DC-DC to LDO when the supply voltage falls below the minimum supply voltage necessary for DC-DC operation.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DCDC_FORCE_1</name>
                                <description>DC-DC regulator operation forced. Automatic fail-safe mechanism is disabled and device continues to operate out of DC-DC regulator.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>VCORETRAN</name>
                        <description>Controls core voltage level transition time</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>VCORETRAN_0</name>
                                <description>32 s / 100 mV</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>VCORETRAN_1</name>
                                <description>64 s / 100 mV</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>VCORETRAN_2</name>
                                <description>128 s / 100 mV (default)</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>VCORETRAN_3</name>
                                <description>256 s / 100 mV</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PSSIE</name>
                  <displayName>IE</displayName>
                  <description>Interrupt Enable Register</description>
                  <addressOffset>0x34</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>SVSMHIE</name>
                        <description>High-side SVSM interrupt enable</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>SVSMHIE_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SVSMHIE_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PSSIFG</name>
                  <displayName>IFG</displayName>
                  <description>Interrupt Flag Register</description>
                  <addressOffset>0x38</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>SVSMHIFG</name>
                        <description>High-side SVSM interrupt flag</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>SVSMHIFG_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>SVSMHIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SVSMHIFG_1</name>
                                <description>Interrupt due to SVSMH</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PSSCLRIFG</name>
                  <displayName>CLRIFG</displayName>
                  <description>Clear Interrupt Flag Register</description>
                  <addressOffset>0x3C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>CLRSVSMHIFG</name>
                        <description>SVSMH clear interrupt flag</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRSVSMHIFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRSVSMHIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRSVSMHIFG_1</name>
                                <description>Clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
