cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401Y.svd
            <register>
                  <name>FLCTL_IE</name>
                  <displayName>IE</displayName>
                  <description>Interrupt Enable Register</description>
                  <addressOffset>0xF4</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>RDBRST</name>
                        <description>If set to 1, enables the Controller to generate an interrupt based on the corresponding bit in the FLCTL_IFG</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>AVPRE</name>
                        <description>If set to 1, enables the Controller to generate an interrupt based on the corresponding bit in the FLCTL_IFG</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>AVPST</name>
                        <description>If set to 1, enables the Controller to generate an interrupt based on the corresponding bit in the FLCTL_IFG</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRG</name>
                        <description>If set to 1, enables the Controller to generate an interrupt based on the corresponding bit in the FLCTL_IFG</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRGB</name>
                        <description>If set to 1, enables the Controller to generate an interrupt based on the corresponding bit in the FLCTL_IFG</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ERASE</name>
                        <description>If set to 1, enables the Controller to generate an interrupt based on the corresponding bit in the FLCTL_IFG</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BMRK</name>
                        <description>If set to 1, enables the Controller to generate an interrupt based on the corresponding bit in the FLCTL_IFG</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRG_ERR</name>
                        <description>If set to 1, enables the Controller to generate an interrupt based on the corresponding bit in the FLCTL_IFG</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_CLRIFG</name>
                  <displayName>CLRIFG</displayName>
                  <description>Clear Interrupt Flag Register</description>
                  <addressOffset>0xF8</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>RDBRST</name>
                        <description>Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>AVPRE</name>
                        <description>Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>AVPST</name>
                        <description>Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>PRG</name>
                        <description>Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>PRGB</name>
                        <description>Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>ERASE</name>
                        <description>Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>BMRK</name>
                        <description>Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>PRG_ERR</name>
                        <description>Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_SETIFG</name>
                  <displayName>SETIFG</displayName>
                  <description>Set Interrupt Flag Register</description>
                  <addressOffset>0xFC</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>RDBRST</name>
                        <description>Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>AVPRE</name>
                        <description>Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>AVPST</name>
                        <description>Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>PRG</name>
                        <description>Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>PRGB</name>
                        <description>Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>ERASE</name>
                        <description>Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>BMRK</name>
                        <description>Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>PRG_ERR</name>
                        <description>Write 1 clears the corresponding interrupt flag bit in the FLCTL_IFG</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_READ_TIMCTL</name>
                  <displayName>READ_TIMCTL</displayName>
                  <description>Read Timing Control Register</description>
                  <addressOffset>0x100</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                    <field>
                        <name>SETUP</name>
                        <description>Configures the length of the Setup phase for this operation</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>IREF_BOOST1</name>
                        <description>Length of the IREF_BOOST1 signal of the IP</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SETUP_LONG</name>
                        <description>Length of the Setup time into read mode when the device is recovering from one of the following conditions: Moving from Power-down or Standby back to Active and device is not trimmed. Moving from standby to active state in low-frequency active mode. Recovering from the LDO Boost operation after a Mass Erase.</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_READMARGIN_TIMCTL</name>
                  <displayName>READMARGIN_TIMCTL</displayName>
                  <description>Read Margin Timing Control Register</description>
                  <addressOffset>0x104</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                    <field>
                        <name>SETUP</name>
                        <description>Length of the Setup phase for this operation</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_PRGVER_TIMCTL</name>
                  <displayName>PRGVER_TIMCTL</displayName>
                  <description>Program Verify Timing Control Register</description>
                  <addressOffset>0x108</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                    <field>
                        <name>SETUP</name>
                        <description>Length of the Setup phase for this operation</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ACTIVE</name>
                        <description>Length of the Active phase for this operation</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HOLD</name>
                        <description>Length of the Hold phase for this operation</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_ERSVER_TIMCTL</name>
                  <displayName>ERSVER_TIMCTL</displayName>
                  <description>Erase Verify Timing Control Register</description>
                  <addressOffset>0x10C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                    <field>
                        <name>SETUP</name>
                        <description>Length of the Setup phase for this operation</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_LKGVER_TIMCTL</name>
                  <displayName>LKGVER_TIMCTL</displayName>
                  <description>Leakage Verify Timing Control Register</description>
                  <addressOffset>0x110</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                    <field>
                        <name>SETUP</name>
                        <description>Length of the Setup phase for this operation</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_PROGRAM_TIMCTL</name>
                  <displayName>PROGRAM_TIMCTL</displayName>
                  <description>Program Timing Control Register</description>
                  <addressOffset>0x114</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                    <field>
                        <name>SETUP</name>
                        <description>Length of the Setup phase for this operation</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ACTIVE</name>
                        <description>Length of the Active phase for this operation</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x14</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HOLD</name>
                        <description>Length of the Hold phase for this operation</description>
                        <bitOffset>0x1C</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_ERASE_TIMCTL</name>
                  <displayName>ERASE_TIMCTL</displayName>
                  <description>Erase Timing Control Register</description>
                  <addressOffset>0x118</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                    <field>
                        <name>SETUP</name>
                        <description>Length of the Setup phase for this operation</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ACTIVE</name>
                        <description>Length of the Active phase for this operation</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x14</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HOLD</name>
                        <description>Length of the Hold phase for this operation</description>
                        <bitOffset>0x1C</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_MASSERASE_TIMCTL</name>
                  <displayName>MASSERASE_TIMCTL</displayName>
                  <description>Mass Erase Timing Control Register</description>
                  <addressOffset>0x11C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                    <field>
                        <name>BOOST_ACTIVE</name>
                        <description>Length of the time for which LDO Boost Signal is kept active</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BOOST_HOLD</name>
                        <description>Length for which Flash deactivates the LDO Boost signal before processing any new commands</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_BURSTPRG_TIMCTL</name>
                  <displayName>BURSTPRG_TIMCTL</displayName>
                  <description>Burst Program Timing Control Register</description>
                  <addressOffset>0x120</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                    <field>
                        <name>ACTIVE</name>
                        <description>Length of the Active phase for this operation</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x14</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
