cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401Y.svd
            <register>
                  <name>RSTCTL_SOFTRESET_STAT</name>
                  <displayName>SOFTRESET_STAT</displayName>
                  <description>Soft Reset Status Register</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>SRC0</name>
                        <description>If 1, indicates that SRC0 was the source of the Soft Reset</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC1</name>
                        <description>If 1, indicates that SRC1 was the source of the Soft Reset</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC2</name>
                        <description>If 1, indicates that SRC2 was the source of the Soft Reset</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC3</name>
                        <description>If 1, indicates that SRC3 was the source of the Soft Reset</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC4</name>
                        <description>If 1, indicates that SRC4 was the source of the Soft Reset</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC5</name>
                        <description>If 1, indicates that SRC5 was the source of the Soft Reset</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC6</name>
                        <description>If 1, indicates that SRC6 was the source of the Soft Reset</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC7</name>
                        <description>If 1, indicates that SRC7 was the source of the Soft Reset</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC8</name>
                        <description>If 1, indicates that SRC8 was the source of the Soft Reset</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC9</name>
                        <description>If 1, indicates that SRC9 was the source of the Soft Reset</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC10</name>
                        <description>If 1, indicates that SRC10 was the source of the Soft Reset</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC11</name>
                        <description>If 1, indicates that SRC11 was the source of the Soft Reset</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC12</name>
                        <description>If 1, indicates that SRC12 was the source of the Soft Reset</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC13</name>
                        <description>If 1, indicates that SRC13 was the source of the Soft Reset</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC14</name>
                        <description>If 1, indicates that SRC14 was the source of the Soft Reset</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC15</name>
                        <description>If 1, indicates that SRC15 was the source of the Soft Reset</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RSTCTL_SOFTRESET_CLR</name>
                  <displayName>SOFTRESET_CLR</displayName>
                  <description>Soft Reset Status Clear Register</description>
                  <addressOffset>0x14</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>SRC0</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC1</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC2</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC3</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC4</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC5</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC6</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC7</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC8</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC9</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC10</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC11</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC12</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC13</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC14</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC15</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RSTCTL_SOFTRESET_SET</name>
                  <displayName>SOFTRESET_SET</displayName>
                  <description>Soft Reset Status Set Register</description>
                  <addressOffset>0x18</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>SRC0</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset)</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC1</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset)</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC2</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset)</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC3</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset)</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC4</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset)</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC5</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset)</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC6</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset)</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC7</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset)</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC8</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset)</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC9</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset)</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC10</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset)</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC11</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset)</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC12</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset)</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC13</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset)</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC14</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset)</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC15</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset)</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RSTCTL_PSSRESET_STAT</name>
                  <displayName>PSSRESET_STAT</displayName>
                  <description>PSS Reset Status Register</description>
                  <addressOffset>0x100</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x0000000f</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>SVSMH</name>
                        <description>Indicates if POR was caused by an SVSMH trip condition int the PSS</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BGREF</name>
                        <description>Indicates if POR was caused by a BGREF not okay condition in the PSS</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VCCDET</name>
                        <description>Indicates if POR was caused by a VCCDET trip condition in the PSS</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SVSL</name>
                        <description>Indicates if POR was caused by an SVSL trip condition in the PSS</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RSTCTL_PSSRESET_CLR</name>
                  <displayName>PSSRESET_CLR</displayName>
                  <description>PSS Reset Status Clear Register</description>
                  <addressOffset>0x104</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>CLR</name>
                        <description>Write 1 clears all PSS Reset Flags in the RSTCTL_PSSRESET_STAT</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
