cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401Y.svd
            <register>
                  <name>SYS_SRAM_BLKRET_CTL3</name>
                  <displayName>SRAM_BLKRET_CTL3</displayName>
                  <description>SRAM Block Retention Control Register 3</description>
                  <addressOffset>0x7C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>BLK96_EN</name>
                        <description>When 1, Block96 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK96_EN_0</name>
                                <description>Block96 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK96_EN_1</name>
                                <description>Block96 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK97_EN</name>
                        <description>When 1, Block97 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK97_EN_0</name>
                                <description>Block97 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK97_EN_1</name>
                                <description>Block97 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK98_EN</name>
                        <description>When 1, Block98 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK98_EN_0</name>
                                <description>Block98 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK98_EN_1</name>
                                <description>Block98 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK99_EN</name>
                        <description>When 1, Block99 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK99_EN_0</name>
                                <description>Block99 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK99_EN_1</name>
                                <description>Block99 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK100_EN</name>
                        <description>When 1, Block100 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK100_EN_0</name>
                                <description>Block100 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK100_EN_1</name>
                                <description>Block100 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK101_EN</name>
                        <description>When 1, Block101 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK101_EN_0</name>
                                <description>Block101 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK101_EN_1</name>
                                <description>Block101 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK102_EN</name>
                        <description>When 1, Block102 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK102_EN_0</name>
                                <description>Block102 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK102_EN_1</name>
                                <description>Block102 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK103_EN</name>
                        <description>When 1, Block103 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK103_EN_0</name>
                                <description>Block103 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK103_EN_1</name>
                                <description>Block103 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK104_EN</name>
                        <description>When 1, Block104 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK104_EN_0</name>
                                <description>Block104 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK104_EN_1</name>
                                <description>Block104 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK105_EN</name>
                        <description>When 1, Block105 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK105_EN_0</name>
                                <description>Block105 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK105_EN_1</name>
                                <description>Block105 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK106_EN</name>
                        <description>When 1, Block106 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK106_EN_0</name>
                                <description>Block106 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK106_EN_1</name>
                                <description>Block106 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK107_EN</name>
                        <description>When 1, Block107 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK107_EN_0</name>
                                <description>Block107 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK107_EN_1</name>
                                <description>Block107 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK108_EN</name>
                        <description>When 1, Block108 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK108_EN_0</name>
                                <description>Block108 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK108_EN_1</name>
                                <description>Block108 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK109_EN</name>
                        <description>When 1, Block109 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK109_EN_0</name>
                                <description>Block109 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK109_EN_1</name>
                                <description>Block109 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK110_EN</name>
                        <description>When 1, Block110 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK110_EN_0</name>
                                <description>Block110 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK110_EN_1</name>
                                <description>Block110 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK111_EN</name>
                        <description>When 1, Block111 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK111_EN_0</name>
                                <description>Block111 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK111_EN_1</name>
                                <description>Block111 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK112_EN</name>
                        <description>When 1, Block112 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK112_EN_0</name>
                                <description>Block112 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK112_EN_1</name>
                                <description>Block112 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK113_EN</name>
                        <description>When 1, Block113 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x11</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK113_EN_0</name>
                                <description>Block113 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK113_EN_1</name>
                                <description>Block113 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK114_EN</name>
                        <description>When 1, Block114 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK114_EN_0</name>
                                <description>Block114 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK114_EN_1</name>
                                <description>Block114 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK115_EN</name>
                        <description>When 1, Block115 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK115_EN_0</name>
                                <description>Block115 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK115_EN_1</name>
                                <description>Block115 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK116_EN</name>
                        <description>When 1, Block116 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK116_EN_0</name>
                                <description>Block116 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK116_EN_1</name>
                                <description>Block116 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK117_EN</name>
                        <description>When 1, Block117 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x15</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK117_EN_0</name>
                                <description>Block117 of the SRAM is not retained in LPM3 or LPM4</description>
